//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
////C语言是结构化的程序设计语言！
////生活中的三种结构：顺序结构
////                   
////                  选择结构
//// 
////                  循环结构              
//
//
//
////分支语句（C语言用0表示假，非0就是真）
////语句一：ifelse(默认只能控制一条语句）
//// 语法结构
//// if（表达式）    if（表达式）      if（表达式） 
////     语句；          语句一；         语句一；
////                 else              elif
////                     语句二；         语句二；
////                                   else
////语句二：switch                                 语句三；
////
//
////C语言中（;）隔开的就是语句
//
//
//
//
////int main()
////{
////	int age = 20;
////
////	if (age >= 20)
////		printf("成年\n");
////	else
////	{
////		printf("未成年\n");
////		printf("不能谈恋爱\n");
////	}//用大括号括起来才能执行多条语句
////	return 0;
////}
//
////int main()
////{
////	int age = 60;
////
////	if (age < 18)
////		printf("少年\n");
////	else if (age >= 18 && age < 26)
////		printf("青年\n");
////	else if (age >= 26 && age < 40)
////		printf("中年\n");
////	else//非必须
////		printf("hehe\n");
////
////		
////
////	return 0;
////}
//
//
////int main()
////{
////	int a = 0;
////	int b = 2;
////	if (a == 1)
////	{
////		if (b == 2)
////			printf("hehe\n");
////		else//else和它最近的if匹配
////			printf("haha\n");//侧面说明代码分隔的重要性
////	}
////
////
////	return 0;
////}
//
////if语句书写对比
////代码1
////if (条件) {
////	return x；
////}
////    return y；
////代码2
////if（条件）
////{
////
////    return y；
////
//// }
////	return x；
////
////}
////else
////{
//
////int test()
////{
////	if (1)
////		return 0;
////
////	printf("hehe\n");
////	return 1;
////}
//
////int main()
////{
////	int num = 3;
////
////	//if (num = 5
////	if (5 == num)//当两个整型变量比较是常量写左边
////		printf("hehe\n");
////
////
////
////}
//
////int main()
////{
////	int a = 0;
////	while (a < 100 )
////	{
////		printf("奇数：%d\n", ++a);
////		a++;
////		
////	}
////	
////
////	
////
////	return 0;
////
////	
////
////	
////}
//
//
////int main()
////{
////	//C++
////	//c99支持这样写
////	//如果不支持得加int a=0;
////	for (int i = 1; i <= 100; i++)
////	{
////		if (i % 2 == 1)
////			printf("%d ", i);
////	}
////}
//
//
//
//
//
//
//
//
