//未来从事计算机相关的开发测试工作，软考，计算机二级没用。
//面试官考察：笔试——技术笔试
//            面试——（2面技术面+hr面）
//            技术面：技术理解+写代码+问项目
// 英语4/6级对于找工作帮助不大（大厂没用，小公司要）
// 4/6级过了，不代表英语水平过关
// 毕业学校有要求/英语很重要，技术前沿需要
// 
//


//作用域和生命周期
//哪里起作用哪里就是它的作用域(局部变量的作用域就是它所在的局部范围）
//全局变量的作用域是整个工程，使用时要申明（例如此全局变量的申明extern int g_val；）
// 执行型代码必须放在大括号内 
//

//int g_val = 2021;//全局变量
////
////
////
//#include <stdio.h>;
////
//
//int main()
//{
//
//	printf("hehe\n");
//	{
//		int a = 10;
//		printf("a=%d\n", a);
//	}
//	printf("%d\n", g_val);
//
//	return 0;
//
//}



//生命周期
//变量的生命周期：变量的创建和销毁之间的时间段
//
// 局部变量的生命周期：进入局部范围生命周期开始，出局部范围生命周期结束
// 全局变量的生周周期：全局变量的生命周期就是程序的生命周期




























