//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
////C语言提供的关键字
////1.C语言提供的，不能自己创建关键字
////2.关键字不能做变量名
//
//
//
//
//int main()
//{
//
//	//{
//	//	auto int a = 10;//自动创建自动销毁--自动变量（可以省略）每个局部变量都由它修饰
//
//
//	//}
//
//	//extern用来申明外部符号
//	                 
//
//
//
//	//大量频繁使用的数据局，想存放在寄存器中，提升效率。
//	//register int num = 100;//建议num的值存放在寄存器中
//						   //register寄存器关键字
//	                       //计算机中数据可以存放在---寄存器、高速缓存、内存、硬盘、网盘（存在云端）//往箭头方向造价越高，速度越快，空间越小
//	                             //                       <-----------------------------------------                                               
//
//	//signed  有符号的//unsigned 无符号的
//
//	//static 静态的
//	//union  联合体（共用体）
//
//	//void 无--空
//	//volatile  C语言暂时不讲
//
//	//define   include 不是关键字叫做预处理指令
//
//	return 0;
//
//
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
