//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//
//
//
//int main()
//{
//	/*int a = 0;
//	printf("%d\n", ~a);*///~按位取反(把所有二进制位中的数字1变为0,0变为1）（包括符号位）
//    //0的二进制：00000000000000000000000000000000
//	//按位取反后：11111111111111111111111111111111
//	//整数在内存中储存的是补码
//	//整数的二进制有三种表示方法：原码   反码   补码
//
//	//例如（针对负数，对于正整数原码反码补码相同）：-1    原码：1（符号位）00000000000000000000001
//	//                                                    反码：1（符号位不变其它位变）11111111111111111111110
//	//                                                    补码（反码二进制加1=补码）：11111111111111111111111111111111
//	//                                                    补码---->原码（逆过程）
//	//int a = 1;
//	//int b = (++a) + (++a) + (++a);//不建议研究，不同编译器结果不同
//	//printf("%d\n", b);
//
//	//int a = 3.14;//浮点型
//	//int a =(int) 3.14;//（类型）-----强制类型转换
//	//printf("%d\n", a);
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	//int a = 10;
//	//int b = a++;//后置++，先使用，再++
//	//printf("%d\n", b);
//	//printf("%d\n", a);
//
//
//
//
//
//	//int b = ++a;//前置++    先++后使用
//	//printf("%d\n", b);//11
//	//printf("%d\n", a);//11
//
//	//关系操作符------大于> 
//	//大于等于>=//等等
//
//
//	//逻辑操作符----&&逻辑与
//	//              ||逻辑或
//
//	//int a = 3;
//	//int b = 5;
//	//int c = a && b;
//	//printf("%d\n", c);//结果为1（真）
//
//	//条件操作符（三目操作符）：exp1 ? exp2 : exp3(exp1成立，exp2计算，整个表达式的结构式：exp2的结果）/如果exp1不成立则exp3计算，整个表达式的结构式：exp3
//
//	//int a = 0;
//	//int b = 3;
//	//int max = 0;
//	///*if (a > b)
//	//	max = a;
//	//else
//	//	max = b;*/
//
//
//	//max = a > b ? a : b;//等价表示条件选择语句
//
//	//printf("%d\n", max);
//
//	//逗号表达式：逗号隔开的一串表达式
//
//	//(2, 4 + 5, 6);
//	
//	//int a = 0;
//	//int b = 3;
//	//int c = 5;
//	//int d = (a = b + 2, c = a - 4, b = c + 2);//逗号表达式，是从左向右依次计算的，整个表达式的结果是最后一个表达式的结果
//
//
//	//printf("%d\n", d);
//
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//printf("%d\n", arr[5]);//[]就是下标引用操作符
//
//
//
//
//	printf("hehe\n");//调用函数的时候函数后面的（）就是函数调用操作符
//	//（）可以传多个操作数
//
//
//
//
//
//
//
//	return 0;
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
