//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//
//
////参数是函数与函数交流的方式
//
////Add(int x, int y)
////{
////
////	int z = 0;
////	z = x + y;
////	return z;
////}
////
////
////
////
////
////
////
////
////
////int main()
////{
////	int num1 = 0;
////	int num2 = 0;
////
////	scanf("%d%d", &num1, &num2);
////
////	//int sum = num1 + num2;
////	
////	
////	
////	
////	
////	//函数方式解决
////
////	int sum = Add(num1, num2);
////
////	printf("%d\n", sum);
////
////
////
////
////
////
////
////
////	return 0;
////
////
////
////
////}
//
//
//
////数组---一组相同元素的集合
////10个整型1-10存起来
////数组是用下标来访问的
//
//
//
//
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//数组名字arr，从第一个元素开始下标是0
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d\n", arr[i]);
//	    i++;
//    }
//
//
//
//
//
//	//char ch[5] = { 'a','b','c' };//不完全初始化，剩余的默认为0
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
