//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//
////指针：
////1.内存如何编号？
////2.一个内存单元多大多大空间
//// 
//// 
//
////32位--32根地址线--物理线--通电--1/0
////64位
//
//
//
//
////电信号转换为数字信息：1和0组成的二进制序列
//
////000000000000000000000000
////......
////111111111111111111111111
////2的32次方个编号地址
//
////可以管理2的32次方个内存单元//假设一个内存单元是1bit那么可以管理4294967196个bit/8=536870912bite/1204=524288kb/1024=512mb/1024=0.5gb
////最终一个内存单元是一个字节//一个字节给一个内存单元然后编号
//
////int main()
////{
////	int a = 10;//在内存中要分配空间-4个字节 
////	printf("%p\n", &a);//%p打印地址
////	int* pa = &a;//pa是用来存放地址的，在C语言中pa叫指针变量
////	//* 说明pa是指针变量
////	//int 说明pa执行的对象是int类型的
////	char ch = 'w';
////	char* pc = &ch;
////
////
////
////
////	return 0;
////}
////指针就是地址
////int main()
////{
////	int a = 10;
////	int* pa= &a;
////
////
////	*pa = 20;//*叫做解引用操作(单目操作符）*pa就是通过pa里面的地址，找到a
////
////	printf("%d\n", a);//20
////
////
////	return 0;
////}
////x32
//int main()
//{
//	printf("%d\n", sizeof(char*));//4
//	printf("%d\n", sizeof(int*));//4
//	printf("%d\n", sizeof(short*));//4
//	printf("%d\n", sizeof(long long*));//4
//	printf("%d\n", sizeof(long*));//4
//	//指针大小是相同的，指针用来存放地址的，指针需要多大空间取决于地址的存储需要多大空间
//
//	//32位  32bit--4byte
//	//64位  64bit--8byte
//
//
//
//	return 0;
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
