//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
////操作符：算数操作符  --  乘*
////                    -- 
//// 
//// 
//// 
//// 
////
////
////
//int main()
//{
//	/*int a = 9 / 2;
//	float a = 9 / 2.0;*///除 / （除号两端都是整数执行整数除法得到的是整数部分，有一个是小数得到的是小数）
//
//	//int a = 9 % 2;//%---取模（余）
//
//	//int a = 2;
//	//int b = a << 1;//左移操作符移动的是二进制位a———2（00000000000000000000000000000010）
//
//	//位操作符：
//	//&按位与
//	// |按位或
//	//^按位异或
//	
//	//赋值操作符：
//
//
//	//int a = 2;
//	//a = a + 5;//a += 5;
//
//	//a = a - 3;//a -= 3;
//
//	//单目操作符；例如a+b；其中+有两个操作数，双目操作符
//
//	//单目操作符：只有一个操作数
//
//
//	//int a = 0;
//
//	//printf("%d\n", !a);//!（单目操作符）把真变成假，假变成真（C语言中0为假非0为真）
//
//	//if(a)
//	//{//如果a为真运行
//	//}
//
//	//if(!a)
//	//{//如果a为假运行
//	//}
//
//	//+（正号），（-）负号
//
//	//int a = 10;
//	//printf("%d\n", sizeof(int));//求类型大小（）不可以省略
//
//	//printf("%d\n", sizeof a);//求变量大小（）可以省略
//
//	int arr[10] = { 0 };
//
//	printf("%d\n", sizeof(arr));//计算的是数组的总大小，单位是字节
//
//	printf("%d\n", sizeof(arr[0]));//4
//
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	printf("%d\n", sz);
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//	
//
//
//
//
//
//
//	return 0;
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
