//常量
//1.字面常量

//#include <stdio.h>;
//enum Sex
//{
//	//这种枚举变量可能取值
//	//枚举常量
//
//
//	MALE=3,//赋初值
//	FEMALE,
//	SECRET
//
//};
//
//
//
//
//
////#define MAX 10000
//int main()
//{
//	//1.字面常量
//	//3.14
//	//10
//	//‘10’
//	//abcderf字符串常量
//
//	//2.const修饰的常变量（被其修饰的常变量不可改变本质上还是个变量）
//	//   
//	// 
//
//	//
//	//const int num = 10;//um就是变量具有常属性（不能被改变的属性）
//	//printf("num=%d\n", num);
//
//	//int arr[10] = { 0 };//10个元素
//
//	//const int n = 10;
//	//int arr2[n] = { 0 };//n是常量这里不行
//	// 
//	// 
//	//3.#define定义的标识符常量
//
//	//MAX=20;错误改法
//    
//
//
//
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
